{"Version":"Alpha 0.0.0.1","Language":[{"Language":"English","AppName":"Eyes Only Mail","AppNameShort":"EOM","NoMail":"You have no mail at this time.","Loading":"Loading...","ShowMessages":"Click to Show Messages...","IntroCopy":["<p style='color: red; text-align: center;'>This is alpha software.  Please note the authors are responsible for nothing, including but not limited to message loss.</p><br>","<p style='text-align: center;'><span style='font-size: 500%;' title='Eyes Only Mail'>&#9863;</span><br><br><b>Eyes Only Mail</b></p>","<ul><li>Like email, only effortlessly private. &nbsp;You don&#39;t have to manage keys or understand anything about cryptography.</li><li>End-to-end encryption. &nbsp;We don&#39;t have your keys, can&#39;t read your messages, can&#39;t know who your friends are -- there&#39;s no way for us to even know who you are.</li><li>Free. &nbsp;We&#39;d have to know who you were to charge you, so that's out.</li><li>Works on most desktops, laptops and phones.</li></ul><br>","<p><span style='font-size: 200%;'>T</span>here are many legitimate reasons people need to be able to communicate privately. Lawyers talking to clients, reporters exchanging information with confidential sources, human rights activists, your wife sending you a sizzling birthday greeting reminding you she loves you madly when you’re stuck working on the road. Some communication is simply for your eyes only and is no one else’s business. Period. And that’s before you get to repressive governments performing mass surveillance.</p>","<p>Eyes Only Mail is a work-in-progress email-like messaging system, designed for more secure communication than regular email, with more persistence than ephemeral text messaging. At the moment, it&rsquo;s also a wobbly toy. A system being created. The first steps in a long slog toward something hopefully useful. The goal ultimately is to design a secure messaging system that doesn&rsquo;t require the user to understand cryptography or manage keys or ever see ciphertext. Simply connect with those you need to communicate with in as easy a manner as possible and send messages privately without having to give any thought to the security.</p>","<p>Eyes Only Mail is not intended to be a full replacement for regular email, but rather a supplement to it, much like encrypted text messaging is a supplement to SMS text messaging. If you want to reach out to someone you don&#39;t know or sign up for the daily ads of your favorite retailer, regular email is hard to beat. But if you need to send your accountant details of a credit card statement or the social security number and payroll setup data of a new employee &ndash; or simply give an itinerary to your relatives of when you&#39;ll be out of town &ndash; regular email is far from ideal. It even comes up short in exchanging interoffice mail without fear of cyber eavesdroppers.</p><br>","<p><b>Creating an Eyes Only Mail Account</b></p>","<ul><li><p>From EyesOnlyMail.com, click <strong>New User</strong>.</p></li><li><p>Pick out a <strong>user name</strong> (not case sensitive) and <strong>passphrase</strong> (case sensitive), and confirm your passphrase.</p></li><li><p>Fill in your <strong>first and last name</strong> so people will know they&rsquo;ve got the right person when they connect with you (we&rsquo;ll explain how that works in a moment). Don&rsquo;t worry, your name is strongly encrypted and you never send the un-encrypted keys to the server &ndash; or anywhere else for that matter. We&rsquo;ll come back to this point, but Eyes Only Mail does not ever have access to your name, messages, or encryption keys.</p></li></ul>","<p>You can only send mail to people on your contacts list, so now let&rsquo;s look at how you add users to that list.</p><br>","<p><strong>Three Words</strong></p>","<p>All you need to connect with another user is three simple words. Let&rsquo;s say Alice and Bob want to connect. Alice hits the three-words button in her Eyes Only app to open her contact list for discovery. The app gives her three words (not case sensitive) people can use for the next ten, 30, 60, or 180 minutes (Alice&rsquo;s choice) to find her. Bob enters the three words that Alice tells him and the app asks him if he&rsquo;d like to add Alice to his contact list. He says yes and she appears on his contact list and he on hers. When the words expire, Alice&rsquo;s contacts list locks itself down again, but Bob and Alice can now send strongly encrypted messages to one another easily for as long as they like.</p>","<p>Alice can even add more than one person at a time to her contacts list. Say she teaches a college course in computer security and wants all of her new students to be able to add her. She can write her three words on the blackboard and let the entire class join her contacts list at once. When the three words expire, her contacts list locks itself back down automatically.</p><br>","<p><strong>More</strong></p>","<p>That should be enough information to get your started with Eyes Only Mail. But a few more thoughts might be worth mentioning...</p>","<ul><li><p>The EOM system requires a user name and passphrase, which is a security trade off. On the down side, if you&rsquo;re not careful, you can accidentally give your user name and passphrase away to a phishing scheme. On the up side, you can log into the system from any device, jettison that device and easily log in on another. So <strong>a first word of warning</strong> here: never give your user name and passphrase to anyone for any reason ever and always check the url of the page you are logging into to make sure it is the precise site you are intending to log into. Eyes Only Mail will never email you with a link to sign into the system. To avoid phishing schemes, you must come to the log in page on your own. Also, we don&rsquo;t have an email address for you, so an email sent from us to you should be very suspicious indeed.</p></li></ul>","<ul><li><p>Eyes Only Mail is completely <a href='https://github.com/EyesOnlyMail' target='_blank'>open source</a>. Never trust a system that isn&rsquo;t.</p></li></ul>","<ul><li><p>Eyes Only Mail encrypts messages end-to-end, so, as mentioned above, it never knows the names or email addresses or phone numbers of its users. It does not keep or ever get decrypted keys to any of your data nor any passphrase. So a<strong> second word of warning</strong> here: if you forget your user name and/or passphrase, there&rsquo;s not one thing we can do to help you. We wouldn&#39;t begin to know how to search for the cryptographic gibberish that is your account. We have no way of knowing which system ID belongs to what user&rsquo;s ciphertext, and even if we could figure it out, we&rsquo;d have no way of turning that ciphertext into anything resembling language. So this bears repeating: if you forget your user name and/or passphrase, there&rsquo;s not one thing we can do to help you.</p></li></ul>","<ul><li><p>Each of your conversations has its own key, so cracking one doesn&rsquo;t crack the rest.</p></li></ul>","<ul><li><p>That said, <strong>a third word of warning</strong> is in order: we&rsquo;ll do our best to make your messages secure, but when you know you&rsquo;re finished with a sensitive message, take the time to delete it. Persistent messages are at times desirable, even necessary; but persistence is by definition a vulnerability. An absolutely secure persistent message is a myth, but a message that no longer exists is a different story.</p></li></ul>","<ul><li><p>Feel free to use the system for innocuous messaging. If there&rsquo;s one encrypted message in the world, &ldquo;Anne Frank is with her family in the attic. Please swing by the store and grab a diary for her,&rdquo; it&rsquo;s a trivial task to throw a hundred thousand computers at it and eventually crack it. But if there are billions of encrypted messages in the world, that task becomes less trivial. An ocean of messages that say nothing more sensitive than, &ldquo;Who wants tacos for lunch?&rdquo; makes the truly sensitive messages more secure.</p></li></ul>","<p>- Eyes Only Mail</p>","<div style='margin-right: auto; margin-left: auto; width: 52px;'><img src='/Images/EOM.png' style='width: 50px;'></div>","<br><br><p>Credits:<br>crypto-js, &copy; 2009-2013 by Jeff Mott. All rights reserved.<br>js-sha3, &copy; 2016 by Chen, Yi-Cyuan. MIT License.<br>Add to Homescreen, &copy; 2014 Matteo Spinelli, http://cubiq.org/<br>Envelope icon from <a href='http://findicons.com/icon/237861/mail?id=369493' target='_blank'>Find Icons</a><br><a href='http://ckeditor.com/' target='_blank'>CKEditor</a> © 2003 - 2017 CKSource Sp. z o.o. sp.k. All rights reserved.</p>"],"Words":["above","ace","all","almost","always","ankle","animal","ant","age","ape","are","ask","at","ate","apple","around","baboon","badger","bag","ball","bat","bear","be","beaver","bed","bee","beetle","begin","big","bin","bird","bison","blue","bobcat","boa","boat","bog","bow","bossy","boy","box","brass","brush","bucket","buckle","buy","bug","bulldog","bump","bus","butterfly","button","by","cake","camel","car","cat","catfish","cheer","cheetah","coin","colossal","cougar","cow","coyote","crab","crumb","cut","dark","date","day","deer","dent","do","dock","doctor","dog","dolphin","donkey","dot","drip","drippy","drop","dry","duck","dump","eagle","eat","eel","eggs","elf","elm","emu","enjoy","enormous","era","eyes","fad","fan","far","fashion","fat","feather","fedora","ferret","few","fib","fig","fire","fish","fit","fix","floppy","flower","fly","fog","for","fox","friendly","frog","from","fun","fur","gag","gap","giant","gibbon","giraffe","girl","glad","gnome","green","go","goat","goose","gorilla","grin","grow","hat","high","hit","hard","hamster","hare","happy","hot","horse","house","hug","huge","hummingbird","hyena","if","imp","impress","in","ink","into","is","it","jaguar","jelly","jellyfish","jiggle","jolly","kangaroo","kiss","koala","lake","laugh","lazy","lemur","leopard","lion","live","lizard","llama","lobster","lock","love","lucky","macaw","magpie","massive","me","meerkat","mighty","monkey","moose","moat","moot","more","move","mouse","mule","my","near","nearby","newt","no","nod","nose","nut","ocean","octopus","oat","olive","of","on","one","or","orange","ostrich","otter","oyster","ox","panda","pants","panther","parrot","peace","peacock","pelican","penguin","pickle","pig","platypus","poke","poodle","porcupine","puffin","pug","puma","puppy","purple","quick","quiz","rabbit","raccoon","rain","red","reindeer","rhinoceros","ribbon","rubble","rumble","sea","seahorse","seal","sheep","shiny","sip","skunk","slippery","sloth","slow","smart","smile","snail","snout","snuggle","so","soaking","soft","sparrow","sponge","squeeze","squid","squirrel","starfish","steer","stingray","stump","stunning","sun","swan","sunny","sunshine","take","talking","tennis","terrific","through","thunder","tiger","tin","to","toe","tortoise","toucan","tree","tremendous","try","tuck","turkey","tummy","tuxedo","twice","umbrella","up","upstairs","us","van","vast","vine","vulture","walrus","warthog","water","wave","we","weasel","whale","whippet","wild","win","wink","witty","wolf","wombat","won","wonderful","woo","woodpecker","yak","yellow","zebra","zinger","zippy"]}],"Colors":["#00a0ff","#2715aa","#ffba00","#d1664d","#689360","#25822f","#c047ba","#763575","#91160d","#ff1a08","#00FFFF","#8A2BE2","#A52A2A","#5F9EA0","#D2691E","#FF7F50","#6495ED","#DC143C","#00008B","#008B8B","#B8860B","#006400","#8B008B","#556B2F","#9932CC","#8B0000","#483D8B","#2F4F4F","#9400D3","#696969","#1E90FF","#B22222","#228B22","#DAA520","#808080","#008000","#4B0082","#778899","#800000","#0000CD","#9370DB","#3CB371","#7B68EE","#C71585","#191970","#000080","#808000","#6B8E23","#FF4500","#DB7093","#CD853F","#800080","#663399","#4169E1","#8B4513","#2E8B57","#A0522D","#6A5ACD","#708090","#4682B4","#D2B48C","#008080","#FF6347"]}